trade/src/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/НастройкиПодключенияКСистемеБыстрыхПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПодключенияКСистемеБыстрыхПлатежей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИдентификаторМерчанта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПлатежнаяСистема</name>
    <type>
      <types>EnumRef.УдалитьПлатежныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаПеренаправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНастройки</name>
    <type>
      <types>EnumRef.ВариантыНастройкиСБП</types>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ТекстОшибки = "";
	Если Не ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторМерчанта) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле ИдентификаторМерчанта не заполнено.'")
				+ Символы.ПС;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИдентификаторУчастника) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле ИдентификаторУчастника не заполнено.'")
				+ Символы.ПС;
			КонецЕсли;
		Если Не ЗначениеЗаполнено(Родитель) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле Родитель не заполнено.'")
				+ Символы.ПС;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВариантНастройки) Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Поле ВариантНастройки не заполнено.'")
				+ Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Отказ = Истина;
			СистемаБыстрыхПлатежейСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось записать: Настройка подключения к Системе быстрых платежей
						|%1'"),
					ТекстОшибки));
		КонецЕсли;
	КонецЕсли;
	
	// При добавлении первой настройки подключения с Системой быстрых платежей должно быть
	// создано регламентное задание по загрузке идентификаторов платежных.
	УстановитьПривилегированныйРежим(Истина);
	СистемаБыстрыхПлатежейСлужебный.ДобавитьЗаданиеЗагрузкаСтатусовОперацийСБП();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
